# Working with date time

In [1]:
import pandas as pd
df = pd.read_csv('http://bit.ly/uforeports')

In [2]:
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
df.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [4]:
df['Time'] = pd.to_datetime(df.Time)

In [5]:
ts = pd.to_datetime('1/1/1999')

In [6]:
df.loc[df.Time >= ts, :]

,City,Colors Reported,Shape Reported,State,Time
12832,Loma Rica,NaN,LIGHT,CA,1999-01-01 02:30:00
12833,Bauxite,NaN,NaN,AR,1999-01-01 03:00:00
12834,Florence,NaN,CYLINDER,SC,1999-01-01 14:00:00
12835,Lake Henshaw,NaN,CIGAR,CA,1999-01-01 15:00:00
12836,Wilmington Island,NaN,LIGHT,GA,1999-01-01 17:15:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [7]:
df.Time.max() - df.Time.min()

Timedelta('25781 days 01:59:00')

In [8]:
(df.Time.max() - df.Time.min()).days

25781

In [9]:
(df.Time.max() - df.Time.min()).days / 365

70.63287671232877

Plot number of UFOs seen per year

In [10]:
import matplotlib.pyplot as plt
%matplotlib inline

In [11]:
df['Time'] = df.Time.dt.year

In [12]:
df.head()

                   City Colors Reported Shape Reported State  Time
0                Ithaca             NaN       TRIANGLE    NY  1930
1           Willingboro             NaN          OTHER    NJ  1930
2               Holyoke             NaN           OVAL    CO  1931
3               Abilene             NaN           DISK    KS  1931
4  New York Worlds Fair             NaN          LIGHT    NY  1933

In [13]:
df.groupby(['Time']).count().reset_index()

    Time  City  Colors Reported  Shape Reported  State
0   1930     2                0               2      2
1   1931     2                0               2      2
2   1933     1                0               1      1
3   1934     1                0               1      1
4   1935     1                0               1      1
..   ...   ...              ...             ...    ...
63  1996   848              155             510    851
64  1997  1236              226            1138   1237
65  1998  1741              391            1643   1743
66  1999  2774              551            2511   2774
67  2000  2631              507            2396   2635

[68 rows x 5 columns]

In [14]:
#df.Time.value_counts().sort_values().reset_index()

In [ ]:
df.Time.value_counts().sort_index().plot() # takes index as x axis

# Find and remove duplicates

In [ ]:
# movie reviewer dataset
user_cols=['user_id', 'age', 'gender', 'occupation', 'zip_code']
df = pd.read_csv('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, na_filter=False, index_col='user_id') 
#na_filter = False will drop rows with Na values

In [ ]:
df.shape

In [ ]:
df.zip_code.duplicated()   # Returns False if unique and True if same value appeared before

In [ ]:
df[df['zip_code'].duplicated()==False].shape  # Drop duplicated values for a particular column

In [ ]:
df[df.duplicated()==False].shape  # If entire row as same value as row appeared before

In [ ]:
# How many duplicate zip codes   ---> 148 duplicated zip codes  True -> 1 False -> 0
df.zip_code.duplicated().sum()

In [ ]:
df.duplicated()  # will return True if entire row is identical to previous row

In [ ]:
# Return duplicate rows    Return when value is True
df.loc[df.duplicated(), :]

In [ ]:
df.loc[df.duplicated(keep='first'), :] 
# mark duplicates as True except the first occurence
# The first occurence gets kept and all the others in the dataframe gets identified as True

In [ ]:
df.loc[df.duplicated(keep='last'), :]

In [ ]:
df.loc[df.duplicated(keep=False), :]  # Mark all duplicates as True even the first occurence

In [ ]:
df.drop_duplicates(keep='first') #keep='first' <- default setting

### What if you only wanted to consider certain columns when identifying duplicates?
#### Example: age+zip code is unique identifier

In [ ]:
df.duplicated(subset=['age','zip_code']).sum()

In [ ]:
df.drop_duplicates(subset=['age','zip_code'],inplace=True)

# How to handle missing values?

In [ ]:
df = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
df.tail()

In [ ]:
# isnull() dataframe method
df.isnull().tail()

In [ ]:
df.notnull().tail()

In [ ]:
df.isnull().sum()  
#axis=0 do sum accross the rows means sum values for each column

In [ ]:
df[df.City.isnull()].head()

In [ ]:
df.isna().sum()

In [ ]:
df.isnull().sum()

#### Handling missing values
1. Drop missing values

In [ ]:
df.shape

In [ ]:
df.dropna(how='any').shape
# how='any' drop row if any values in the columns is missing

In [ ]:
df.dropna(how='all').shape
# Will drop rows if all the columns has NaN values

In [ ]:
df.dropna(subset=['City', 'Shape Reported'], how='any').shape
# Drop rows if any of City or Shape Reported columns has NaN values

In [ ]:
df['Shape Reported'].value_counts(dropna=False).sort_values(ascending=False) 
# by default missing values are excluded

#### Handling missing values with fillna()

In [ ]:
df['Shape Reported'].fillna(value='VARIOUS', inplace=True)

In [ ]:
df['Shape Reported'].value_counts(dropna=False).sort_values(ascending=False)

#### Grabbing rows where any columns have NaN values

In [ ]:
df.isna().any(axis=1)

In [ ]:
df.loc[df.isna().any(axis=1), :]

## How to apply multiple filter criteria to a pandas DataFrame

In [ ]:
df = pd.read_csv('http://bit.ly/imdbratings')
df.head()

In [ ]:
df[df['duration']>=200].head()

In [ ]:
df[(df['duration']>=200) & (df['genre']=='Crime') & (df['star_rating'] >= 9.0)]

In [ ]:
df[(df['duration']>=200) | (df['genre']=='Crime') | (df['star_rating'] >= 9.0)].head()

In [ ]:
df[df['genre'].isin(['Crime', 'Action'])]

## Apply, Map and Applymap

In [ ]:
import pandas as pd
df = pd.read_csv('http://bit.ly/kaggletrain')
df.head()

Map - Is a series method. It allows you to map an existing value of a series to       a different set of values E.g: transforming sex male, female to 1 and 0

In [ ]:
df['Sex_num'] = df.Sex.map({'male':1, 'female':0})

In [ ]:
df[['Sex','Sex_num']].head()

In [ ]:
#df.loc[0:4, ['Sex','Sex_num']]

apply - It is both a Series method and dataframe method. It applies a function         to each element in a series

#### apply as a series method

In [ ]:
# calculate length of each of the strings in Name column
#df['name_len'] = df.Name.apply(lambda x: len(x)) <--- gives same result
df['name_len'] = df.Name.apply(len) # applies len(one_row)

In [ ]:
#df['name_len']

In [ ]:
# using numpy ceil to roundup values for fare coulmn
import numpy as np
df['Fare_ceil'] = df.Fare.apply(np.ceil)

In [ ]:
df[['Fare','Fare_ceil']].head()

In [ ]:
df.Name.str.split(',').head()

In [ ]:
# We only need the surname, e.g: Braund
def extr_surname(x):
    x=x.split(',')
    return x[0]

df['Surname'] = df.Name.apply(extr_surname)

In [ ]:
df['Surname'].head()

In [ ]:
# Alternative

def get_element(x,position=0):
    return x[position]

df['Surname'] = df.Name.str.split(',').apply(get_element, position=0)

In [ ]:
df['Surname'].head()

In [ ]:
df['Surname'] = df.Name.str.split(',').apply(lambda x: x[0])

In [ ]:
df['Surname'].head()

#### apply as DataFrame method

It applies a function along either axis of a dataframe

In [ ]:
df = pd.read_csv('http://bit.ly/drinksbycountry')
df.head()

In [ ]:
#df.loc[:,['beer_servings','wine_servings','country']]

In [ ]:
df.loc[:,'beer_servings':'wine_servings']

In [ ]:
df.loc[:,'beer_servings':'wine_servings'].apply(max, axis=0) # np.mean

In [ ]:
df.loc[:,'beer_servings':'wine_servings'].apply(max, axis=1)

In [ ]:
# Finding which column has the maximum value
import numpy as np
df.loc[:,'beer_servings':'wine_servings'].apply(np.argmax, axis=1)

#### applymap - DataFrame method. 
Applies function to every element of the dataframe

In [ ]:
df.loc[:,'beer_servings':'wine_servings'].applymap(float)

#### Removing columns from a dataframe

In [ ]:
df = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
df.head()

In [ ]:
df.drop('Colors Reported', axis=1)

#### How to sort a dataframe or series

In [ ]:
df = pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
df.head()

In [ ]:
# Sorting series
df.title.sort_values(ascending=False)

In [ ]:
# Sorting a DataFrame by a series
df.sort_values('title')